(function () {
  console.log('Yaroslava Hryzadubova. Plants. Part1\n------------------------------------------\nScore 100/100\n');
  console.log('Оценка по пунктам:\n------------------------------------------\n');
  console.log('1. Вёрстка валидная (нет ошибок и предупреждений) +10\n');
  console.log('2. Вёрстка семантическая +20 \nВ коде странице присутствуют следующие элементы:\n');
  console.log('- <header>, <main>, <footer> +3\n- пять элементов <section> (по количеству секций) +3\n- только один заголовок <h1> +3\n- четыре заголовка <h2> +3\n- один элемент <nav> (панель навигации) +3\n- два списка ul > li > a (панель навигации, ссылки на соцсети) +3\n- пять кнопок <button> (на странице их 6) +2\n');
  console.log('3. Вёрстка соответствует макету +48\n');
  console.log('- блок <header> +6\n- секция welcome +7\n- секция about +7\n- секция service +7\n- секция prices +7\n- секция contacts +7\n- блок <footer> +7\n');
  console.log('4. Требования к css + 12\n');
  console.log('- для построения сетки используются флексы +2\n- при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2\n- фоновый цвет тянется на всю ширину страницы +2\n- иконки добавлены в формате .svg +2\n- изображения добавлены в формате .jpg или .png +2\n- есть favicon +2\n');
  console.log('5. Интерактивность, реализуемая через css +20\n');
  console.log('- плавная прокрутка по якорям +5\n');
  console.log('- cсылки в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса https://rs.school/js-stage0/ +5\n');
  console.log('- интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +5\n');
  console.log('- обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5\n');
}());